---
kind: method
id: M:Autodesk.Revit.DB.ExportFontTable.Clear
source: html/87e2b7d1-c42c-8c24-fdd2-21ee5f757800.htm
---
# Autodesk.Revit.DB.ExportFontTable.Clear Method

Removes all contents stored in the table.

## Syntax (C#)
```csharp
public void Clear()
```